2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_TechnischToegang/data/VerAntwMutatieberichtHuwelijk-TC03-1-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ABONNEMENT>5671005</ABONNEMENT>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
    <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>034401</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>b8d7340e-02a2-47e5-815d-c898666d56dc</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Mutatiebericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>Abo alleen identificerende groepen en bijbehorende expressies</brp:abonnementNaam>
    <brp:categorieDienst>Mutatielevering op basis van doelbinding</brp:categorieDienst>
  </brp:parameters>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling" brp:verwerkingssoort="Toevoeging">
    <brp:code>04001</brp:code>
    <brp:naam>Voltrekking huwelijk in Nederland</brp:naam>
    <brp:categorie>Actualisering</brp:categorie>
    <brp:partijCode>017401</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Wijziging" brp:communicatieID="1">
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>${result}</brp:actieInhoud>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>46</brp:actieInhoud>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:actieVerval>${result}</brp:actieVerval>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>18</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>1994-10-05</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>695544457</brp:burgerservicenummer>
          <brp:administratienummer>1209234524</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>18</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>1994-10-05</brp:datumAanvangGeldigheid>
          <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
          <brp:voornamen>Petronellaatje</brp:voornamen>
          <brp:scheidingsteken>-</brp:scheidingsteken>
          <brp:geslachtsnaamstam>Verhoeven</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>18</brp:actieInhoud>
          <brp:datum>1994-10-05</brp:datum>
          <brp:gemeenteCode>0777</brp:gemeenteCode>
          <brp:woonplaatsnaam>Etten-Leur</brp:woonplaatsnaam>
          <brp:landGebiedCode>6030</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>18</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>1994-10-05</brp:datumAanvangGeldigheid>
          <brp:code>V</brp:code>
        </brp:geslachtsaanduiding>
        <brp:betrokkenheden>
          <brp:partner brp:objecttype="Betrokkenheid" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:huwelijk brp:objecttype="Relatie" brp:verwerkingssoort="Toevoeging" brp:objectSleutel="*">
              <brp:betrokkenheden>
                <brp:partner brp:objecttype="Betrokkenheid" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Identificatie">
                    <brp:samengesteldeNaam brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:actieInhoud>${result}</brp:actieInhoud>
                      <brp:datumAanvangGeldigheid>2012-10-05</brp:datumAanvangGeldigheid>
                      <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
                      <brp:voornamen>Joep</brp:voornamen>
                      <brp:geslachtsnaamstam>Meloen</brp:geslachtsnaamstam>
                    </brp:samengesteldeNaam>
                    <brp:geboorte brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:actieInhoud>${result}</brp:actieInhoud>
                      <brp:datum>1970-12-12</brp:datum>
                      <brp:gemeenteCode>0345</brp:gemeenteCode>
                      <brp:landGebiedCode>6030</brp:landGebiedCode>
                    </brp:geboorte>
                    <brp:geslachtsaanduiding brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:actieInhoud>${result}</brp:actieInhoud>
                      <brp:datumAanvangGeldigheid>2012-10-05</brp:datumAanvangGeldigheid>
                      <brp:code>M</brp:code>
                    </brp:geslachtsaanduiding>
                  </brp:persoon>
                </brp:partner>
              </brp:betrokkenheden>
            </brp:huwelijk>
          </brp:partner>
        </brp:betrokkenheden>
        <brp:administratieveHandelingen>
          <brp:administratieveHandeling brp:objecttype="AdministratieveHandeling" brp:objectSleutel="*">
            <brp:code>04001</brp:code>
            <brp:naam>Voltrekking huwelijk in Nederland</brp:naam>
            <brp:categorie>Actualisering</brp:categorie>
            <brp:partijCode>017401</brp:partijCode>
            <brp:toelichtingOntlening>toelichting</brp:toelichtingOntlening>
            <brp:bronnen>
              <brp:bron brp:objecttype="AdministratieveHandelingBron" brp:communicatieID="document${result}">
                <brp:document brp:objecttype="Document" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:soortNaam>Huwelijksakte</brp:soortNaam>
                  <brp:identificatie>123</brp:identificatie>
                  <brp:aktenummer>4567890</brp:aktenummer>
                  <brp:partijCode>017401</brp:partijCode>
                </brp:document>
              </brp:bron>
            </brp:bronnen>
            <brp:bijgehoudenActies>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="actie${result}">
                <brp:soortNaam>Registratie aanvang huwelijk geregistreerd partnerschap</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="document${result}"/>
                </brp:bronnen>
              </brp:actie>
            </brp:bijgehoudenActies>
          </brp:administratieveHandeling>
          <brp:administratieveHandeling brp:objecttype="AdministratieveHandeling" brp:objectSleutel="*">
            <brp:code>01001</brp:code>
            <brp:naam>Geboorte in Nederland</brp:naam>
            <brp:categorie>Actualisering</brp:categorie>
            <brp:partijCode>199902</brp:partijCode>
            <brp:bijgehoudenActies>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="actie18">
                <brp:soortNaam>Registratie geboorte</brp:soortNaam>
                <brp:bronnen/>
              </brp:actie>
            </brp:bijgehoudenActies>
          </brp:administratieveHandeling>
          <brp:administratieveHandeling brp:objecttype="AdministratieveHandeling" brp:objectSleutel="*">
            <brp:code>01001</brp:code>
            <brp:naam>Geboorte in Nederland</brp:naam>
            <brp:categorie>Actualisering</brp:categorie>
            <brp:partijCode>199902</brp:partijCode>
            <brp:bijgehoudenActies>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="actie46">
                <brp:soortNaam>Registratie nationaliteit</brp:soortNaam>
                <brp:bronnen/>
              </brp:actie>
            </brp:bijgehoudenActies>
          </brp:administratieveHandeling>
        </brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
            <NAAM>Abo alleen identificerende groepen en bijbehorende expressies</NAAM>
        </Row>
    </ResultSet>
</Results>